{
  "company": {
    "name": "Walmart Inc.",
    "ticker": "WMT",
    "analysisTitle": "Forensic Financial Analysis",
    "heroSubtitle": "QoE TL;DR: Q3 2026 receivables surged +15.2% vs revenue +1.2% (12.9x ratio), a critical flag suggesting aggressive sales booking. This repeats a similar Q3 2025 pattern (107.8x ratio), indicating a recurring year-end cash collection issue.",
    "pageTitle": "ForensicFinancials | Walmart Inc. (WMT) Analysis"
  },
  "trendAnalysis": {
    "sectionSubtitle": "Walmart's mature, low-single-digit growth trajectory is increasingly reliant on working capital expansion, raising questions about the quality of recent earnings.",
    "cards": [
      {
        "title": "Revenue Trajectory",
        "iconClass": "fas fa-chart-line neutral",
        "points": [
          "<strong>Long-Term Trend:</strong> Over the past two decades, Walmart has transitioned from a high-growth to a mature company, with revenue growth moderating from the high single digits to a more stable 2-7% range annually, reflecting market saturation.",
          "<strong>Recent Performance:</strong> In FY2025, revenue growth was solid at +5.1%, though this represented a deceleration from the +6.0% in FY2024 and +6.7% in FY2023, indicating a potential cooling in top-line momentum.",
          "<strong>Quality Signal:</strong> In Q3 2026, receivables (money owed by customers) grew +15.2% while revenue was nearly flat at +1.2%, a 12.9x divergence that signals potential channel stuffing (pushing inventory to distributors) or aggressive sales recognition."
        ],
        "footer": "Growth is stable but the extreme Q3 receivables spike suggests a reliance on non-cash (accrual-driven) sales to meet targets."
      },
      {
        "title": "Profitability Trends",
        "iconClass": "fas fa-chart-pie negative",
        "points": [
          "<strong>Margin Trajectory:</strong> Historically, Walmart's margins have been volatile, with periods of expansion often followed by sharp compression due to cost pressures or strategic markdowns, indicating limited pricing power in a competitive retail environment.",
          "<strong>Recent Pressure:</strong> FY2023 operating margins contracted sharply (-26.2%) as the company absorbed inflationary costs and used aggressive markdowns to clear excess inventory, a clear sign of significant operational stress.",
          "<strong>Operating Leverage:</strong> Q3 2026 demonstrated negative operating leverage (how costs amplify profit swings), with operating income falling -8.1% on just +1.2% revenue growth as operating expenses grew faster than sales."
        ],
        "footer": "Recent margin compression for three straight quarters (Q1-Q3 2026) indicates that cost control is a significant near-term challenge."
      },
      {
        "title": "Cash Flow & Earnings Quality",
        "iconClass": "fas fa-chart-bar negative",
        "points": [
          "<strong>OCF/NI Ratio:</strong> The cash conversion ratio (how much profit turned into actual cash) has been inconsistent, with OCF growth lagging Net Income growth by over 10pp in 5 of the last 20 years, including FY2022 and FY2025.",
          "<strong>Working Capital:</strong> In FY2025, the 23.3 percentage point gap between Net Income growth (+25.3%) and OCF growth (+2.0%) was primarily driven by a +13.4% build in receivables (uncollected sales), a classic sign of paper profits.",
          "<strong>Quality Grade:</strong> Q3 2026 earnings quality is weak. Operating Cash Flow (OCF) fell -29.7%, more than double the -12.6% decline in Net Income, showing that cash performance was significantly worse than reported profits."
        ],
        "footer": "Earnings Quality Grade: Concerning. Recurring gaps between cash flow and net income suggest profits are not reliably converting to cash."
      }
    ]
  },
  "financialMetrics": {
    "sectionSubtitle": "Forensic analysis reveals critical flags in receivables and cash conversion, suggesting aggressive accounting practices that obscure underlying operational challenges.",
    "cards": [
      {
        "title": "Forensic Checks",
        "iconClass": "fas fa-search negative",
        "points": [
          "<strong>A/R vs Revenue:</strong> In Q3 2026, receivables grew 12.9x faster than revenue (+15.2% vs +1.2%). This extreme divergence is a critical red flag implying a significant increase in DSO (days to collect payment) and potential for aggressive revenue recognition.",
          "<strong>Inventory vs COGS:</strong> Q3 2026 inventory grew +13.2% while revenue was nearly flat (+1.2%). This build-up of unsold goods ahead of the holiday season risks future markdowns if demand does not meet expectations, pressuring future profits.",
          "<strong>OCF vs NI Gap:</strong> The Q3 2026 cash shortfall was driven by working capital (cash tied up in operations) consumption, as cash was used to fund the +15.2% surge in receivables and +13.2% build in inventory, not from core operations."
        ],
        "footer": "The primary concern is the massive, recurring Q3 receivables spike, which suggests a systemic practice of pulling sales forward or extending credit."
      },
      {
        "title": "Solvency & Capital",
        "iconClass": "fas fa-balance-scale neutral",
        "points": [
          "<strong>Debt Trajectory:</strong> Over the past five years (FY2021-2025), the company has been in a deleveraging phase, with total debt growth remaining modest while equity has generally expanded, strengthening the overall balance sheet.",
          "<strong>Coverage & Liquidity:</strong> Despite a strong balance sheet, the company took on a significant amount of short-term debt (+70.8%) in Q1 2026 to fund a large cash flow deficit, indicating a reliance on financing to manage working capital stress.",
          "<strong>Capital Returns:</strong> Historically, Walmart has used debt to fund capital returns, such as the share buyback program in FY2019-2020. The recent focus has shifted more towards operational funding and deleveraging."
        ],
        "footer": "Solvency is not an immediate risk, but the recent use of debt to cover operational cash shortfalls is a trend to monitor closely."
      }
    ]
  },
  "investmentConsiderations": {
    "sectionSubtitle": "Investors must weigh Walmart's immense scale and market leadership against clear evidence of deteriorating earnings quality and operational pressures.",
    "tableData": [
      {
        "factor": "<strong>Market Position & Moat</strong>",
        "opportunities": "Dominant market share, massive economies of scale, and a powerful omnichannel presence provide a durable competitive advantage and significant cash flow generation capacity.",
        "risks": "Intense competition from Amazon, dollar stores, and traditional grocers limits pricing power. Market saturation in North America restricts organic growth opportunities."
      },
      {
        "factor": "<strong>Innovation & Strategy</strong>",
        "opportunities": "Growth in high-margin areas like third-party marketplace, advertising (Walmart Connect), and subscription services (Walmart+) could meaningfully improve profitability over time.",
        "risks": "Heavy investment in e-commerce and supply chain automation carries significant execution risk and may continue to pressure margins and cash flow in the near term."
      },
      {
        "factor": "<strong>Financial Structure & Capital</strong>",
        "opportunities": "A fortress balance sheet and strong credit ratings provide access to low-cost capital, offering flexibility for investments, acquisitions, and shareholder returns.",
        "risks": "Recent reliance on short-term debt to fund operational cash gaps is a concern. Continued weakness in cash conversion could force a choice between investment and capital returns."
      },
      {
        "factor": "<strong>Forensic & Earnings Quality</strong>",
        "opportunities": "A sharp reversal of the receivables build in Q4 and a sustained OCF/NI ratio (cash conversion) above 1.0x would signal that recent issues were temporary and restore confidence.",
        "risks": "Persistent divergence between receivables and revenue growth, coupled with weak cash conversion, indicates systemic issues that could lead to future earnings write-downs or restatements."
      }
    ]
  },
  "conclusion": {
    "sectionSubtitle": "The analysis reveals a high-quality business franchise employing low-quality accounting tactics to manage earnings, creating a significant risk for investors.",
    "verdictTitle": "Elite Franchise, Troubling Practices",
    "verdictRating": "Elevated Concerns / Medium-High Risk",
    "paragraphs": [
      "Walmart is a global retail leader, but its recent financial reporting shows signs of strain. In <strong>Q3 2026, receivables surged an alarming 12.9 times faster than revenue</strong>, a critical red flag that suggests the company is aggressively booking sales on credit to meet targets. This, combined with weak cash flow and compressing margins, points to a disconnect between reported profits and underlying business health.",
      "<strong>What this means for you:</strong> The numbers suggest Walmart's reported profits may be 'paper profits' (recorded on paper, not yet cash). While the company's size provides a safety net, these accounting games can't last forever. You should be cautious and watch the next earnings report (Q4 2026) to see if the company <strong>actually collects the cash from these sales</strong>. If not, the stock could face pressure as the market questions the true earnings power."
    ],
    "monitoringPointsTitle": "Key Monitoring Points",
    "monitoringPoints": [
      "<strong>Receivables vs. Revenue Growth:</strong> The ratio was a critical 12.9x in Q3 2026. Watch for this ratio to fall below 2.0x in Q4 2026. A continued high ratio means the cash from Q3 sales isn't being collected, a major warning.",
      "<strong>Cash Flow vs. Net Income:</strong> In Q3 2026, Operating Cash Flow fell -29.7%, far worse than the -12.6% Net Income decline. OCF must exceed Net Income in Q4 2026 to prove earnings are real and not just accounting entries.",
      "<strong>Inventory Growth:</strong> Inventory grew +13.2% in Q3 2026 on just +1.2% revenue growth. Watch for inventory growth to align with sales growth in Q4 2026. If it doesn't, expect future profit-hurting markdowns."
    ]
  },
  "chartData": {
    "labels": [
      "2006",
      "2007",
      "2008",
      "2009",
      "2010",
      "2011",
      "2012",
      "2013",
      "2014",
      "2015",
      "2016",
      "2017",
      "2018",
      "2019",
      "2020",
      "2021",
      "2022",
      "2023",
      "2024",
      "2025"
    ],
    "revenueGrowth": [
      9.775,
      11.711,
      8.138,
      7.223,
      0.948,
      3.373,
      5.846,
      4.959,
      1.631,
      1.965,
      -0.725,
      0.776,
      2.978,
      2.81,
      1.858,
      6.716,
      2.433,
      6.728,
      6.026,
      5.07
    ],
    "arGrowth": [
      50.146,
      10.291,
      28.239,
      7.221,
      6.12,
      22.804,
      16.663,
      13.997,
      -1.345,
      1.513,
      -17.026,
      3.752,
      -3.787,
      11.917,
      0.016,
      3.692,
      27.072,
      -4.191,
      10.879,
      13.404
    ],
    "cfoGrowth": [
      17.21,
      14.354,
      0.942,
      13.722,
      13.401,
      -9.928,
      2.589,
      5.508,
      -9.12,
      22.819,
      -3.543,
      14.438,
      -10.127,
      -2.061,
      -9.001,
      42.839,
      -32.968,
      19.271,
      23.872,
      2.007
    ],
    "niGrowth": [
      9.389,
      0.472,
      12.823,
      5.106,
      7.391,
      14.05,
      -4.21,
      8.281,
      -5.747,
      2.128,
      -10.2,
      -7.153,
      -27.714,
      -32.367,
      1.231,
      -9.213,
      1.207,
      -14.576,
      32.8,
      25.305
    ]
  }
}